Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/telecommunications_and_postal_services/dealing_with_unwanted_telephone_sales_calls.html.txt.tmx
Source language: en
Languages: ga

source: Dealing with unwanted telephone sales calls
ga: Ag déileáil le glaonna díolacháin teileafóin gan iarraidh

source: Cold calling means that you receive unwanted sales calls in your home from companies that you have not had any dealings with until that time
ga: Glaonna mangaireachta a thugtar ar ghlaonna díolacháin gan iarraidh a chuireann cuideachtaí ort i do theach nach ndearna tú gnó leo cheana go dtí an tráth sin

source: You can now register your preference not to receive such cold calls using the National Directory Database
ga: Féadfaidh tú do rogha a chlárú anois gan na glaonna mangaireachta siúd a fháil trí leas a bhaint as Bunachar Sonraí an Eolaire Náisiúnta

source: You may still receive calls where your views are being sought in connection with market surveys
ga: B’fhéidir go gcuirfear glaonna ort go fóill nuair atá do thuairimí á lorg maidir le suirbhéanna margaidh

source: The National Directory Database is a list of all telephone numbers contained in public phone books or available through directory enquiries
ga: Liosta atá i mBunachar Sonraí an Eolaire Náisiúnta de gach uimhir ghutháin a chuimsítear i leabhair ghutháin phoiblí nó atá ar fáil trí sheirbhísí eolaí gutháin

source: Your preference not to receive cold calls is recorded on the National Directory Database by the company who receives a line rental payment from you
ga: Cláraíonn an chuideachta a fhaigheann íocaíocht chíos líne uait do rogha gan glaonna mangaireachta a chur ort, ar Bhunachar Sonraí an Eolaire Náisiúnta

source: This should be done within 5 working days of you notifying them of this preference
ga: Ba cheart go mbeadh seo déanta laistigh de 5 lá oibre tar éis duit fógra a thabhairt dóibh faoin rogha seo

source: It can subsequently take up to 28 days for this information to filter through to marketing companies who make ‘cold calls’
ga: D’fhéadfadh sé a fhad le 28 lá a ghlacadh ina dhiaidh sin go mbainfidh an fhaisnéis seo cuideachtaí margaíochta amach a chuireann ‘glaonna mangaireachta’

source: This register only applies to calls that are made in Ireland
ga: Ní bhaineann an clár ach le glaonna a chuirtear in Éirinn

source: If companies persist in cold calling you
ga: Má leanann cuideachtaí orthu agus glaonna mangaireachta á gcur acu ort

source: If a company makes a cold call to your home and you have registered your preference not to be called more than 28 days before you should, in the first instance, let the company know that you do not wish to receive cold calls
ga: Má chuireann cuideachta glao mangaireachta ar do theach agus má chláraigh tú do rogha gan glao ort breis agus 28 lá roimh ré, ba cheart duit, ar an gcéad dul síos, a chur in iúl don chuideachta nach mian leat go gcuirfear glaonna mangaireachta ort

source: You can also complain to the Data Protection Commissioner
ga: Ina theannta sin, féadfaidh tú gearán a dhéanamh leis an gCoimisinéir Cosanta Sonraí

source: If you are or have recently been a customer of the company who is calling you or you have indicated that you wish to get these calls these rules do not apply
ga: Más custaiméir thú nó má bhíteá i do chustaiméir den chuideachta a bhfuil glaonna á gcur acu ort nó má thug tú le fios gur mian leat go gcuirfear na glaonna seo ort, ní bhaineann na rialacha seo

source: A reputable company should, however, respect your wishes not to be called
ga: Ba cheart go ndéanfadh cuideachta chreidiúnach meas a léiriú ar do mhian gan glao a chur ort, áfach

source: Since October 2006 ex-directory numbers can also be included in the register of those who do not wish to receive cold calls
ga: Ó Dheireadh Fómhair 2006, is féidir uimhreacha nach bhfuil san eolaire a chur san áireamh i gclár na ndaoine siúd ar mian leo nach gcuirfear glaonna mangaireachta orthu

source: If your number is ex-directory you do not have to register your preference not to have companies call you as it is done automatically
ga: Mura bhfuil d’uimhir san eolaire, níl ort do rogha a chlárú nach gcuirfidh cuideachtaí glao ort, mar gheall go ndéantar seo go huathoibríoch

source: If you have an ex-directory number and do not want to be included in the register contact your operator to whom you pay your line rental and ask not to be included
ga: Má tá uimhir agat nach bhfuil san eolaire agus mura mian leat a bheith san áireamh sa chlár, déan teagmháil le d’oibreoir lena n-íocann tú do chíos líne agus iarr orthu thú a chur san áireamh

source: Mobile telephone network operators have barred all direct marketing companies from making cold calls to mobile phone numbers
ga: Chuir oibreoirí líonra guthán póca cosc ar gach cuideachta margaíochta dírí ó ghlaonna mangaireachta a chur ar uimhreacha guthán póca

source: If you want to allow direct marketers to contact you in this way, you can call your mobile service provider and ask that your number be made available to direct marketers
ga: Más mian leat ligean do mhargóirí teagmháil a dhéanamh leat ar an mbealach seo, féadfaidh tú glao a chur ar sholáthróir do sheirbhíse guthán póca agus iarr orthu d’uimhir a chur ar fáil do mhargóirí díreacha

source: There is no charge for registering your preference not to have marketing calls on the National Directory Database
ga: Níl aon táille ar d'iarratas a chlárú ar Bhunachar Sonraí an Eolaire Náisiúnta gan glaonna margaíochta a fháil

source: Contact the company to whom you pay a line rental charge and let them know that you do not wish to receive unsolicited marketing calls from companies
ga: Déan teagmháil leis an gcomhlacht a n-íocann tú cíos líne leo agus abair leo nach bhfuil tú ag iarraidh glaonna margaíochta gan iarraidh ó chomhlachtaí

source: They will then insure that your preference not to receive cold calls is recorded on the National Directory Database
ga: Breathnóidh siad sin chuige go gclárófar d'iarratas ar Bhunachar Sonraí an Eolaire Náisiúnta gan glacadh le glaonna fuara

source: The Commission for Communications Regulations (ComReg) provides information about dealing with cold calls on its website
ga: Soláthraíonn an Coimisiún um Rialáil Cumarsáide (ComReg) faisnéis faoi dhéileáil le mangaireacht fóin ar a suíomh gréasáin

source: Any company who breaks the rules may face prosecution by the Office of the Data Protection Commissioners
ga: Aon chomhlacht a bhriseann na rialacha, d'fhéadfadh Oifig na gCoimisinéirí Cosanta Sonraí iad a thabhairt ag an gcúirt

source: You can read more about the Data Protection Commissioner’s requirements for making a complaint here
ga: Is féidir leat tuilleadh a léamh faoi riachtanais an Choimisinéara Cosanta Sonraí maidir le gearán a dhéanamh anseo
